In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.DataFrame(np.arange(3,12).reshape(3,3),index=['ril', 'infy','tcs'],columns=["return10","return20","return30"])

In [3]:
df.head()

      return10  return20  return30
ril          3         4         5
infy         6         7         8
tcs          9        10        11

In [4]:
 df.to_csv('test')

In [5]:
df.loc['ril']

return10    3
return20    4
return30    5
Name: ril, dtype: int32

In [6]:
df.iloc[:2,0:3]

      return10  return20  return30
ril          3         4         5
infy         6         7         8

In [13]:
df.iloc[:,0:].values

array([[ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [15]:
df.isnull().sum()

return10    0
return20    0
return30    0
dtype: int64

In [16]:
df

      return10  return20  return30
ril          3         4         5
infy         6         7         8
tcs          9        10        11

In [18]:
df['return10'].value_counts()

9    1
6    1
3    1
Name: return10, dtype: int64

In [10]:
df['return10'].count()

3

In [11]:
df['return10'].unique()

array([3, 6, 9])

In [22]:
from io import StringIO, BytesIO

In [26]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '8,orange,cow,10')

In [24]:
type(data)

str

In [28]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [31]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [41]:
data = ('a,b,c\n'
       '5,apple,bat,\n'
       '6,orange,cow')

In [42]:
pd.read_csv(StringIO(data))

        a    b   c
5   apple  bat NaN
6  orange  cow NaN

In [43]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  5   apple  bat
1  6  orange  cow